-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2023-08-05 19:03:14
-- 伺服器版本： 10.4.28-MariaDB
-- PHP 版本： 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `hw`
--

-- --------------------------------------------------------

--
-- 資料表結構 `客戶`
--

CREATE TABLE `客戶` (
  `客戶編號` varchar(5) NOT NULL,
  `公司名稱` varchar(50) DEFAULT NULL,
  `聯絡人` varchar(30) DEFAULT NULL,
  `聯絡人職稱` varchar(30) DEFAULT NULL,
  `聯絡人性別` varchar(2) DEFAULT NULL,
  `郵遞區號` varchar(10) DEFAULT NULL,
  `地址` varchar(60) DEFAULT NULL,
  `電話` varchar(24) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `客戶`
--

INSERT INTO `客戶` (`客戶編號`, `公司名稱`, `聯絡人`, `聯絡人職稱`, `聯絡人性別`, `郵遞區號`, `地址`, `電話`) VALUES
('C0001', '心宥川公司', '謝方怡', '業務', '女', '115', '台北市南港區忠孝東路五段', '(02) 778-9652'),
('C0002', '玫瑰花卉', '徐禹維', '業務', '男', '807', '高雄市三民區克武路4巷', '(07) 556-6665'),
('C0003', '日盛金樓', '吳中平', '董事長', '男', '408', '台中市南屯區向學路', '(03) 862-9682'),
('C0004', '東信銀行', '謝世彬', '訂貨員', '男', '811', '高雄市楠梓區興楠路', '(07) 555-8888'),
('C0005', '五金行', '莊海川', '業務', '男', '974', '花蓮縣壽豐鄉大學路二段', '(06) 245-9665'),
('C0006', '優勢企業', '劉顯忠', '行銷專員', '男', '261', '宜蘭縣頭城鎮協天路706巷', '(06) 556-3365'),
('C0007', '業永房屋', '蔡爵如', '董事長', '男', '104', '台北市中山區八德路', '(02) 765-5252'),
('C0008', '信義建設', '林美孜', '會計人員', '女', '105', '台北市松山區健康路', '(02) 322-7628'),
('C0009', '林木材料', '吳嘉修', '業務助理', '男', '807', '高雄市三民區金山路', '(07) 256-6932'),
('C0010', '悅式海鮮店', '王中志', '訂貨員', '男', '221', '台北縣汐止市莊敬街', '(02) 695-7788'),
('C0011', '丁泉', '周俊安', '業務', '男', '931', '屏東縣石光村中巷1號', '(08) 305-5011'),
('C0012', '富同公司', '邵雲龍', '董事長', '男', '104', '台北市中山區農安街', '(02) 591-9766'),
('C0013', '權勝', '李姿玲', '董事長', '女', '400', '台中市仁愛路四段59號', '(03) 555-4822'),
('C0014', '科瑞棧藝品', '黃靖貿', '會計人員', '女', '221', '台北縣汐止市大同路三段', '(02) 695-9682'),
('C0015', '宏詮工業', '朱晉陞', '業務', '男', '302', '新竹縣竹北市光明六路', '(04) 358-6932'),
('C0016', '日新日公司', '李豫恩', '業務助理', '男', '407', '台中市西屯區協和里工業區37路', '(03) 999-5681');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `客戶`
--
ALTER TABLE `客戶`
  ADD PRIMARY KEY (`客戶編號`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
